using System.Collections;
using System.Collections.Generic;

public class Language_CN
{
    public static string[] UI_arg = new string[] {
        "开始",
        "关卡",
        "动物图鉴",
        "技能树",
        "统计",
        "挑战关卡",
        "设置",
        "音乐",
        "音量",
        "开发团队",
        "紫海工作室",
        "退出"
    };


    public static string[] Char_arg = new string[] {
        "中国犀牛",
        "金丝猴",
        "丹顶鹤",
        "穿山甲"
    };

    public static string[] Skil_arg = new string[] {
        "快跑",
        "伪装I",
        "无畏冲撞I",
        "伪装II",
        "无畏冲撞II",
        "穿山甲",
        "地道数I",
        "抗风化",
        "地道数II",
        "地底之王I",
        "清道夫",
        "地底之王II",
        "金丝猴",
        "香蕉皮",
        "一分为二",
        "大胃王",
        "顽猴I",
        "顽猴II",
        "顽猴III",
        "丹顶鹤",
        "骚扰",
        "俯冲突刺",
        "空中领主I",
        "空中领主II",
        "空中领主III"
    };

    public static string[] tips_arg = {
        "躲在草丛里面，敌人就不会发现了哦~",
        "巧妙地利用你的动物朋友们，可以更安全地进行救援",
        "必须逃离猎人的瞄准范围，才能躲避麻醉弹",
        "金丝猴不会被猎人抓住，他可以代替你做更多危险的事情",
        "穿山甲的洞能让你在两点之间互相传送，不过洞口很快会被风化",
        "穿山甲不会被敌人发现，尽情地穿行吧",
        "加强技能后地穿山甲可以安全触发地面上的捕兽夹，让它们报废",
        "丹顶鹤能让你躲过猎人的视线以及部分障碍地形在空中飞行",
        "丹顶鹤在带枪的猎人远处会被发现",
        "金丝猴能吃掉路上的香蕉，扔出香蕉皮绊倒猎人",
        "每一关朋友帮忙的次数有限，要谨慎使用哦~",
        "动物在走动的时候不能解锁笼子",
        "犀牛的初级冲撞必须在被猎人发现之前对猎人使用",
        "金丝猴也能穿越穿山甲的洞哦~",
        "科学怪老头不会跑来抓你，但是会抓走你身上的动物宝宝"
    };

}
